app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function loginVerif()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $userModel = new User();

        $user = $userModel->where('email', $email)->first();

SELECT *
FROM `product`
WHERE `product`.`id` = '1'
---
    public function productById($id)
    {
        $productModel = new Product();

        $product = $productModel->find($id);

INSERT INTO `product` (`nama_produk`, `deskripsi`, `harga`, `jumlah_stok`) VALUES ('test123', 'test123', '1000', '12')
SELECT *
FROM `product`
WHERE `product`.`id` = 101
---
    public function createproductPost()
    {
        $productModel = new Product();

        $id = $this->request->getVar('id');
        $nama_produk = $this->request->getVar('nama_produk');
        $deskripsi = $this->request->getVar('deskripsi');
        $harga = $this->request->getVar('harga');
        $jumlah_stok = $this->request->getVar('stok');

        $productId = $productModel->insert([
            'nama_produk' => $nama_produk,
            'deskripsi' => $deskripsi,
            'harga' => $harga,
            'jumlah_stok' => $jumlah_stok
        ]);
        $product = $productModel->find($productId);